# EndTangent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FlexPipe..::..EndTangent Property
FlexPipe Class See Also
---
Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ EndTangent { get; set; }
```

Visual Basic
---
```text
Public Property EndTangent As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ EndTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace